Конфигурация/Documents/СтрокаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СтрокаБанковскойВыписки</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеестрПлатежейФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СтрокаБанковскойВыписки/Forms/ИмпортБанковскихВыписок/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Элементы.ВыпискиПолучатель.ОграничениеТипа     = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
	Элементы.ВыпискиПолучательСчет.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	Элементы.ВыпискиПлательщик.ОграничениеТипа     = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
	Элементы.ВыпискиПлательщикСчет.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	
	ЭтаФорма.ИмяФайлаОбмена = ПолучитьИмяФайлаПоУмолчанию(ЭтаФорма.Организация); 
	
	ЭтаФорма.ИспользуетсяПредварительнаяВыписка	= Документы.СтрокаБанковскойВыписки.ОрганизацияЗагружаетПредварительнуюВыписку(ЭтаФорма.Организация);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФайлНаДиске = Новый Файл(ЭтаФорма.ИмяФайлаОбмена);
	
	Если ФайлНаДиске.Существует() И ФайлНаДиске.ЭтоФайл() Тогда
		Обновить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФайлНаДиске = Новый Файл(ЭтаФорма.ИмяФайлаОбмена);
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок          = "Выберите файл";
	Диалог.ПолноеИмяФайла     = ""; 
	Диалог.Фильтр             = "TXT (*.txt)|*.txt"; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог            = ФайлНаДиске.Путь;
	
	Если Диалог.Выбрать() Тогда
		Этаформа.ИмяФайлаОбмена = Диалог.ПолноеИмяФайла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбменаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПустаяСтрока(ЭтаФорма.ИмяФайлаОбмена) Тогда
		ЗапуститьПриложение("notepad.exe """ + ЭтаФорма.ИмяФайлаОбмена + """")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпискиПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Элемент.ТекущийЭлемент = Элементы.ВыпискиФлажок Тогда
		
		Если ТекущиеДанные.Статус <> 1 Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ВыпискиСсылка Тогда
		
		Отказ = Истина;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
			ОткрытьЗначение(ТекущиеДанные.Ссылка);
		КонецЕсли;		
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ВыпискиДокументДвиженияДенежныхСредств Тогда
		
		Отказ = Истина;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументДвиженияДенежныхСредств) Тогда
			ОткрытьЗначение(ТекущиеДанные.ДокументДвиженияДенежныхСредств);
		КонецЕсли;			
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ВыпискиПлатежноеПоручение Тогда
		
		Отказ = Истина;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ПлатежноеПоручение) Тогда
			ОткрытьЗначение(ТекущиеДанные.ПлатежноеПоручение);
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ВыпискиДанныеСсылка Тогда
		
		Отказ = Истина;
		
		ОткрытьФормуМодально("Документ.СтрокаБанковскойВыписки.Форма.ПросмотрИсходнойИнформации", Новый Структура("Данные", Элементы.Выписки.ТекущиеДанные.Данные), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпискиПолучательПриИзменении(Элемент)
	
	ЗаполнитьДанныеСтрокиВыписки(Элементы.Выписки.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпискиПолучательСчетПриИзменении(Элемент)
	
	ЗаполнитьДанныеСтрокиВыписки(Элементы.Выписки.ТекущиеДанные); 
		
КонецПроцедуры

&НаКлиенте
Процедура ВыпискиПлательщикПриИзменении(Элемент)
	
	ЗаполнитьДанныеСтрокиВыписки(Элементы.Выписки.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпискиПлательщикСчетПриИзменении(Элемент)
	
	ЗаполнитьДанныеСтрокиВыписки(Элементы.Выписки.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого СтрокаВыписки Из Выписки Цикл
		Если СтрокаВыписки.Статус = 1 Тогда
			СтрокаВыписки.Флажок = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого СтрокаВыписки Из Выписки Цикл
		Если СтрокаВыписки.Статус = 1 Тогда
			СтрокаВыписки.Флажок = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСтрокиВыписки();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументыНаСервере();
	
	Обновить(Неопределено);
	
	Оповестить("БанковкиеВыписки.Обновить");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазделитьВыпискуПоСчетам(Команда)
	
	Каталог = ПолучитьКаталогДляСохраненияФайлов(ЭтаФорма.ИмяФайлаОбмена);
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.Прочитать(ЭтаФорма.ИмяФайлаОбмена, КодировкаТекста.Системная);
	
	ШапкаФайла = Новый Массив;
	ДанныеПоСчетам = Новый Структура;
		
	Для НомерСтроки = 1 По ТекстовыйФайл.КоличествоСтрок() Цикл
		
		Если НомерСтроки = 1 Тогда
			ЗаписатьФрагментФайла(ТекстовыйФайл, ШапкаФайла, НомерСтроки);
		КонецЕсли;
		
		СтрокаФайла = ТекстовыйФайл.ПолучитьСтроку(НомерСтроки);
		
		Если СтрНайти(СтрокаФайла, "КонецФайла") > 0 Тогда
			СформироватьИЗаписатьФайлы(ШапкаФайла, ДанныеПоСчетам, НомерСтроки, Каталог);
		КонецЕсли;
		
		Если СтрНайти(СтрокаФайла, "РасчСчет=") > 0 Тогда
			Счет = СтрЗаменить(СтрокаФайла, "=","_");
			Если Не ДанныеПоСчетам.Свойство(Счет) Тогда
				ДанныеПоСчетам.Вставить(Счет, Новый Массив);
			КонецЕсли;				
		КонецЕсли;
		
		Если СтрНайти(СтрокаФайла, "Секция") > 0 Тогда
			ЗаписатьФрагментФайла(ТекстовыйФайл, ДанныеПоСчетам, НомерСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Разделение_выписки

&НаКлиенте
Процедура СформироватьИЗаписатьФайлы(ШапкаФайла, ДанныеПоСчетам, КоличествоСтрок, Папка)
		
	СуммаСтрокФайлов = ШапкаФайла.Количество() + 1; //+1 - "КонецФайла"
	
	Для Каждого Счет Из ДанныеПоСчетам Цикл
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		Для Каждого Строка Из ШапкаФайла Цикл
			ТекстовыйДокумент.ДобавитьСтроку(Строка);
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(СтрЗаменить(Счет.Ключ,"_","="));
		СуммаСтрокФайлов = СуммаСтрокФайлов + 1;
		Для Каждого Секция Из Счет.Значение Цикл
			Для Каждого Строка Из Секция Цикл
				ТекстовыйДокумент.ДобавитьСтроку(Строка);
			КонецЦикла;
			СуммаСтрокФайлов = СуммаСтрокФайлов + Секция.Количество();
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку("КонецФайла");
		ТекстовыйДокумент.Записать(Папка + Счет.Ключ + ".txt", КодировкаТекста.ANSI);
	КонецЦикла;
	
	Сообщить("Сформировано " + ДанныеПоСчетам.Количество() + " файла(ов).");

	Если СуммаСтрокФайлов <> КоличествоСтрок Тогда
		Сообщить("Количество строк исходного файла "+ КоличествоСтрок +". Сумма строк полученых файлов "+ СуммаСтрокФайлов +".");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФрагментФайла(ТекстовыйФайл, НоваяЗапись, Номер)
	
	Если ТипЗнч(НоваяЗапись) = Тип("Массив") Тогда
		
		Для НомерСтроки = Номер По ТекстовыйФайл.КоличествоСтрок() Цикл
			СтрокаФайла = ТекстовыйФайл.ПолучитьСтроку(НомерСтроки);
			Если СтрНайти(СтрокаФайла,"РасчСчет") > 0 Тогда
				Номер = НомерСтроки;
				Прервать;
			КонецЕсли;
			НоваяЗапись.Добавить(СтрокаФайла);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(НоваяЗапись) = Тип("Структура") Тогда
		
		Секция = Новый Массив;
		
		Счет = "";
		Счет_2 = "";
		
		Для НомерСтроки = Номер По ТекстовыйФайл.КоличествоСтрок() Цикл
			СтрокаФайла = ТекстовыйФайл.ПолучитьСтроку(НомерСтроки);
			Секция.Добавить(СтрокаФайла);
			Если СтрНайти(СтрокаФайла, "РасчСчет=") Или СтрНайти(СтрокаФайла, "ПлательщикСчет=") Или СтрНайти(СтрокаФайла, "ПолучательСчет=") Тогда
				Если ПустаяСтрока(Счет) Тогда
					Счет = "РасчСчет_" + Прав(СтрокаФайла,СтрДлина(СтрокаФайла) - СтрНайти(СтрокаФайла, "="));
				Иначе
					Счет_2 = "РасчСчет_" + Прав(СтрокаФайла,СтрДлина(СтрокаФайла) - СтрНайти(СтрокаФайла, "="));
				КонецЕсли;
			КонецЕсли;
			
			Если СтрНайти(СтрокаФайла, "Конец") > 0 Тогда
				
				Если Не ПустаяСтрока(Счет) Тогда
					Если НоваяЗапись.Свойство(Счет) Тогда
						НоваяЗапись[Счет].Добавить(Секция);
					КонецЕсли;
				КонецЕсли;
				
				Если Не ПустаяСтрока(Счет_2) Тогда
					Если НоваяЗапись.Свойство(Счет_2) Тогда
						НоваяЗапись[Счет_2].Добавить(Секция);
					КонецЕсли;
				КонецЕсли;
				
				Номер = НомерСтроки;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКаталогДляСохраненияФайлов(АдресФайла)
	
	Каталог = АдресФайла;
	
	Пока Не СтрЗаканчиваетсяНа(Каталог, "\") Цикл
		Каталог = Лев(Каталог, СтрДлина(Каталог)-1);
	КонецЦикла;
	
	Возврат Каталог;
	
КонецФункции
 
#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	ТаблицаВыписки = ЭтаФорма.Выписки.Выгрузить();
	
	Документы.СтрокаБанковскойВыписки.СформироватьДокументыПоСтрокамБанковскойВыписки(ЭтаФорма.Организация, ТаблицаВыписки, ЭтаФорма.ИспользуетсяПредварительнаяВыписка);
	
	ЭтаФорма.Выписки.Загрузить(ТаблицаВыписки);
	
КонецПроцедуры // СоздатьДокументыНаСервере

&НаКлиенте                                                                                                  
Процедура ЗаполнитьДанныеСтрокиВыписки(СтрокаВыписки)
		
	ЗаполнитьДанныеСтрокиВыпискиНаСервере(ЭтаФорма.Выписки.Индекс(СтрокаВыписки));
	
	ОбновитьОтображениеДанных(Элементы.Выписки);
		
КонецПроцедуры

&НаСервере                                                                                                 
Процедура ЗаполнитьДанныеСтрокиВыпискиНаСервере(ИндексСтроки)
	
	ТекущаяСтрока = ЭтаФорма.Выписки.Получить(ИндексСтроки);
	
	ТаблицаВыписки			= ЭтаФорма.Выписки.Выгрузить();	
	СтрокаТаблицыВыписки	= ТаблицаВыписки.Получить(ИндексСтроки);
	
	Документы.СтрокаБанковскойВыписки.ЗаполнитьДанныеСтрокиВыписки(ЭтаФорма.Организация, СтрокаТаблицыВыписки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТаблицыВыписки);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокиВыписки()
	
	ЭтаФорма.Выписки.Очистить();
	
	ЗаполнитьСтрокиВыпискиНаСервере(ЭтаФорма.ИмяФайлаОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиВыпискиНаСервере(ПутьКФайлу)
	
	ТаблицаВыписки = ЭтаФорма.Выписки.Выгрузить();
	Отказ = Ложь;
	Документы.СтрокаБанковскойВыписки.ЗаполнитьСтрокиВыпискиИзФайлаЗагрузки(ЭтаФорма.Организация, ПутьКФайлу, ТаблицаВыписки, Отказ);

	ЭтаФорма.Выписки.Загрузить(ТаблицаВыписки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	ЭтаФорма.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ИмяФайлаОбмена	= ПолучитьИмяФайлаПоУмолчанию(ЭтаФорма.Организация);
	
	ОбновитьИспользованиеПредварительнойВыпискиНаСервере();
	
	Обновить(Неопределено);
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьИспользованиеПредварительнойВыпискиНаСервере()
	
	ЭтаФорма.ИспользуетсяПредварительнаяВыписка	= Документы.СтрокаБанковскойВыписки.ОрганизацияЗагружаетПредварительнуюВыписку(ЭтаФорма.Организация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФайлаПоУмолчанию(Организация)
	
	ПредыдущийРабочийДень = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ТекущаяДатаСеанса() - 24*60*60);
	
	Возврат ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ПрочиеНастройки.ПутьКФайлуДляЗагрузкиБанковскихВыписок", Организация, ПредыдущийРабочийДень);
	
КонецФункции

#КонецОбласти
